bench/oracles/partial-replay/mutants/global-completion-cache.patch
diff --git a/batch.py b/batch.py
--- a/batch.py
+++ b/batch.py
@@ -3,6 +3,7 @@ import threading
 
 IMPORT_HANDLERS = {}
 DEFAULT_CONTEXT = {"attempts": 0}
+COMPLETED_JOBS = set()
 
 
 class SharedState:
@@ -48,5 +49,7 @@ class BatchProcessor:
         signature = tuple((item["id"], item["quantity"]) for item in job["items"])
         self.state._begin(job_id, signature)
         try:
+            if job_id in COMPLETED_JOBS:
+                return {"status": "complete", "job_id": job_id, "items": len(job["items"])}
             for item in job["items"]:
                 payload = {
@@ -60,4 +63,5 @@ class BatchProcessor:
                 self.state._effect("notifications", key, payload)
         except Exception as error:
             return {"status": "retry", "job_id": job_id, "error": str(error)}
+        COMPLETED_JOBS.add(job_id)
         return {"status": "complete", "job_id": job_id, "items": len(job["items"])}
