bench/oracles/restart-storm/mutants/fail-open-readiness.patch
diff --git a/src/health-service.ts b/src/health-service.ts
--- a/src/health-service.ts
+++ b/src/health-service.ts
@@ -20,3 +20,14 @@ export class HealthService {
   async readiness(): Promise<boolean> {
-    return this.processState.running;
+    let timeout: ReturnType<typeof setTimeout> | undefined;
+    try {
+      const deadline = new Promise<boolean>((resolve) => {
+        timeout = setTimeout(() => resolve(false), 50);
+      });
+      const available = await Promise.race([this.database.isAvailable(), deadline]);
+      return this.processState.running && available;
+    } catch {
+      return true;
+    } finally {
+      if (timeout) clearTimeout(timeout);
+    }
   }
