bench/oracles/restart-storm/mutants/readiness-aliases-liveness.patch
diff --git a/src/health-service.ts b/src/health-service.ts
--- a/src/health-service.ts
+++ b/src/health-service.ts
@@ -20,3 +20,3 @@ export class HealthService {
   async readiness(): Promise<boolean> {
-    return this.processState.running;
+    return await this.liveness();
   }
