bench/oracles/restart-storm/mutants/shared-database-probe.patch
diff --git a/src/health-service.ts b/src/health-service.ts
--- a/src/health-service.ts
+++ b/src/health-service.ts
@@ -16,3 +16,3 @@ export class HealthService {
   async liveness(): Promise<boolean> {
-    return this.processState.running;
+    return await this.readiness();
   }
@@ -20,3 +20,14 @@ export class HealthService {
   async readiness(): Promise<boolean> {
-    return this.processState.running;
+    if (!this.processState.running) return false;
+    let timeout: ReturnType<typeof setTimeout> | undefined;
+    try {
+      const deadline = new Promise<boolean>((resolve) => {
+        timeout = setTimeout(() => resolve(false), 50);
+      });
+      return await Promise.race([this.database.isAvailable(), deadline]);
+    } catch {
+      return false;
+    } finally {
+      if (timeout) clearTimeout(timeout);
+    }
   }
